{"News": [{"Source": "The Hacker News", "Title": "PoC Exploits Released for Citrix ADC and Gateway RCE Vulnerability", "Date": "Sat, 11 Jan 2020 02:22:37 PST", "Description": "It's now or never to prevent your enterprise servers running vulnerable versions of Citrix application delivery, load balancing, and Gateway solutions from getting hacked by remote attackers.\n\nWhy the urgency? Earlier today, multiple groups publicly released weaponized proof-of-concept exploit code [1, 2] for a recently disclosed remote code execution vulnerability in Citrix's NetScaler ADC<img src=\"http://feeds.feedburner.com/~r/TheHackersNews/~4/I8Tx34-GV64\" height=\"1\" width=\"1\" alt=\"\"/>", "URL": "https://thehackernews.com/2020/01/citrix-adc-gateway-exploit.html"}, {"Source": "The Hacker News", "Title": "Critical Firefox 0-Day Under Active Attacks – Update Your Browser Now!", "Date": "Thu, 09 Jan 2020 02:34:19 PST", "Description": "Attention! Are you using Firefox as your web browsing software on your Windows, Linux, or Mac systems?\n\nIf yes, you should immediately update your free and open-source Firefox web browser to the latest version available on Mozilla's website.\n\nWhy the urgency? Mozilla earlier today released Firefox 72.0.1 and Firefox ESR 68.4.1 versions to patch a critical zero-day vulnerability in its browsing<img src=\"http://feeds.feedburner.com/~r/TheHackersNews/~4/DoAwkbwSvmA\" height=\"1\" width=\"1\" alt=\"\"/>", "URL": "https://thehackernews.com/2020/01/firefox-cyberattack.html"}, {"Source": "The Hacker News", "Title": "Researchers Demonstrate How to Hack Any TikTok Account by Sending SMS", "Date": "Thu, 09 Jan 2020 10:14:32 PST", "Description": "TikTok, the 3rd most downloaded app in 2019, is under intense scrutiny over users' privacy, censoring politically controversial content and on national-security grounds—but it's not over yet, as the security of billions of TikTok users would be now under question.\n\nThe famous Chinese viral video-sharing app contained potentially dangerous vulnerabilities that could have allowed remote attackers<img src=\"http://feeds.feedburner.com/~r/TheHackersNews/~4/oFxt48B8hO8\" height=\"1\" width=\"1\" alt=\"\"/>", "URL": "https://thehackernews.com/2020/01/hack-tiktok-account.html"}, {"Source": "The Hacker News", "Title": "3 Google Play Store Apps Exploit Android Zero-Day Used by NSO Group", "Date": "Tue, 07 Jan 2020 08:41:42 PST", "Description": "Watch out! If you have any of the below-mentioned file managers and photography apps installed on your Android phone—even if downloaded from the official Google Store store⁠—you have been hacked and being tracked.\n\nThese newly detected malicious Android apps are Camero, FileCrypt, and callCam that are believed to be linked to Sidewinder APT, a sophisticated hacking group specialized in cyber<img src=\"http://feeds.feedburner.com/~r/TheHackersNews/~4/gXdTFvgA_as\" height=\"1\" width=\"1\" alt=\"\"/>", "URL": "https://thehackernews.com/2020/01/android-zero-day-malware-apps.html"}, {"Source": "The Hacker News", "Title": "Are You Ready for Microsoft Windows 7 End of Support on 14th January 2020?", "Date": "Tue, 07 Jan 2020 07:02:17 PST", "Description": "January 14, 2020, is a day cybersecurity stakeholders should pay attention to, as it marks the end of Microsoft support in Windows 7.\n\nFrom a security perspective, both the routine monthly security patches as well as hotfixes for attacks in the wild will not be available, effectively making any newly discovered vulnerability a Windows 7 zero-day.\n\nCynet 360 autonomous breach protection is a<img src=\"http://feeds.feedburner.com/~r/TheHackersNews/~4/dT63NsbgZsQ\" height=\"1\" width=\"1\" alt=\"\"/>", "URL": "https://thehackernews.com/2020/01/windows-7-support-ends.html"}, {"Source": "The Hacker News", "Title": "Xiaomi Cameras Connected to Google Nest Expose Video Feeds From Others", "Date": "Fri, 03 Jan 2020 02:58:18 PST", "Description": "Internet-connected devices have been one of the most remarkable developments that have happened to humankind in the last decade. Although this development is a good thing, it also stipulates a high security and privacy risk to personal information.\n\nIn one such recent privacy mishap, smart IP cameras manufactured by Chinese smartphone maker Xiaomi found mistakenly sharing surveillance footage<img src=\"http://feeds.feedburner.com/~r/TheHackersNews/~4/newruk6yknM\" height=\"1\" width=\"1\" alt=\"\"/>", "URL": "https://thehackernews.com/2020/01/google-nest-xiaomi-camera.html"}, {"Source": "The Hacker News", "Title": "Landry's Restaurant Chain Suffers Payment Card Theft Via PoS Malware", "Date": "Thu, 02 Jan 2020 12:13:32 PST", "Description": "Landry's, a popular restaurant chain in the United States, has announced a malware attack on its point of sale (POS) systems that allowed cybercriminals to steal customers' payment card information.\n\nLandry's owns and operates more than 600 bars, restaurants, hotels, casinos, food and beverage outlets with over 60 different brands such as Landry's Seafood, Chart House, Saltgrass Steak House,<img src=\"http://feeds.feedburner.com/~r/TheHackersNews/~4/IFnt28Puyyo\" height=\"1\" width=\"1\" alt=\"\"/>", "URL": "https://thehackernews.com/2020/01/landry-pos-malware-attack.html"}, {"Source": "The Hacker News", "Title": "How Organizations Can Defend Against Advanced Persistent Threats", "Date": "Wed, 25 Dec 2019 08:44:16 PST", "Description": "Advanced persistent threats (APTs) have emerged to be legitimate concerns for all organizations. APTs are threat actors that breach networks and infrastructures and stealthily lurk within them over extended spans of time.\n\nThey typically perform complex hacks that allow them to steal or destroy data and resources.\n\nAccording to Accenture, APTs have been organizing themselves into groups that<img src=\"http://feeds.feedburner.com/~r/TheHackersNews/~4/G3u8mYL36vY\" height=\"1\" width=\"1\" alt=\"\"/>", "URL": "https://thehackernews.com/2019/12/apt-cyber-attacks.html"}, {"Source": "The Hacker News", "Title": "The Best Templates for Posting Cybersecurity Jobs", "Date": "Mon, 23 Dec 2019 04:41:59 PST", "Description": "The cybersecurity of a company is heavily reliant upon the skills and knowledge of the people who install, manage, and operate its security products. This means that recruiting and nurturing the best security team possible should be a CISO's top priority.\n\nCynet's Ultimate Cybersecurity Job Posting Templates (download here) provide a list of the main responsibilities and skills for typical<img src=\"http://feeds.feedburner.com/~r/TheHackersNews/~4/tdB9hHpJVEw\" height=\"1\" width=\"1\" alt=\"\"/>", "URL": "https://thehackernews.com/2019/12/cybersecurity-jobs-templates.html"}, {"Source": "The Hacker News", "Title": "Hacker Who Tried to Blackmail Apple for $100,000 Sentenced in London", "Date": "Sat, 21 Dec 2019 07:39:11 PST", "Description": "A 22-year-old man who claimed to have access to over 300 million iCloud accounts and threatened to factory reset all accounts unless Apple pays ransom has pleaded guilty in London for trying to blackmail Apple.\n\nIn March 2017, Kerem Albayrak from North London claimed to be a spokesman for a hacking group called the \"Turkish Crime Family\" and in possession of 319 million iCloud accounts.<img src=\"http://feeds.feedburner.com/~r/TheHackersNews/~4/Mrug5kVjLEM\" height=\"1\" width=\"1\" alt=\"\"/>", "URL": "https://thehackernews.com/2019/12/hacker-who-tried-to-blackmail-apple-for.html"}, {"Source": "The Hacker News", "Title": "Hackers Behind GozNym Malware Sentenced for Stealing $100 Million", "Date": "Sat, 21 Dec 2019 05:56:48 PST", "Description": "Three members of an international organized cybercrime group that was behind a multi-million dollar theft primarily against U.S. businesses and financial institutions have been sentenced to prison, the U.S. Justice Department announced.\n\nThe criminals used the GozNym banking Trojan to break into more than 4,000 victim computers globally, primarily in the United States and Europe, between 2015<img src=\"http://feeds.feedburner.com/~r/TheHackersNews/~4/M3xKwRSdhDA\" height=\"1\" width=\"1\" alt=\"\"/>", "URL": "https://thehackernews.com/2019/12/goznym-malware-sentenced.html"}, {"Source": "The Hacker News", "Title": "Apple Opens Its Invite-Only Bug Bounty Program to All Researchers", "Date": "Fri, 20 Dec 2019 05:48:08 PST", "Description": "As promised by Apple in August this year, the company today finally opened its bug bounty program to all security researchers, offering monetary rewards to anyone for reporting vulnerabilities in the iOS, macOS, watchOS, tvOS, iPadOS, and iCloud to the company.\n\nSince its launch three years ago, Apple's bug bounty program was open only for selected security researchers based on invitation and<img src=\"http://feeds.feedburner.com/~r/TheHackersNews/~4/6z4p7MVRww4\" height=\"1\" width=\"1\" alt=\"\"/>", "URL": "https://thehackernews.com/2019/12/apple-bug-bounty-program.html"}, {"Source": "The Hacker News", "Title": "Hackers Stole Customers' Payment Card Details From Over 700 Wawa Stores", "Date": "Fri, 20 Dec 2019 02:05:48 PST", "Description": "Have you stopped at any Wawa convenience store and used your payment card to buy gas or snacks in the last nine months?\n\nIf yes, your credit and debit card details may have been stolen by cybercriminals.\n\nWawa, the Philadelphia-based gas and convenience store chain, disclosed a data breach incident that may have exposed payment card information of thousands of customers who used their cards at<img src=\"http://feeds.feedburner.com/~r/TheHackersNews/~4/269yw-cmV8g\" height=\"1\" width=\"1\" alt=\"\"/>", "URL": "https://thehackernews.com/2019/12/wawa-store-hacking.html"}, {"Source": "The Hacker News", "Title": "Drupal Warns Web Admins to Update CMS Sites to Patch a Critical Flaw", "Date": "Thu, 19 Dec 2019 06:42:10 PST", "Description": "If you haven't recently updated your Drupal-based blog or business website to the latest available versions, it's the time.\n\nDrupal development team yesterday released important security updates for its widely used open-source content management software that addresses a critical and three \"moderately critical\" vulnerabilities in its core system.\n\nConsidering that Drupal-powered websites are<img src=\"http://feeds.feedburner.com/~r/TheHackersNews/~4/cUqypTmC5Zw\" height=\"1\" width=\"1\" alt=\"\"/>", "URL": "https://thehackernews.com/2019/12/drupal-website-hacking.html"}, {"Source": "The Hacker News", "Title": "Top 5 Essential Features of Effective Cybersecurity for Web Apps", "Date": "Thu, 19 Dec 2019 04:39:59 PST", "Description": "There's hardly any business nowadays that don't use computers and connect to the Internet. Companies maintain an online presence through their official websites, blogs, and social media pages.\n\nPeople use online services to conduct day to day activities like banking. And of course, there are many businesses that are completely based on the web like online markets, e-Commerce websites and<img src=\"http://feeds.feedburner.com/~r/TheHackersNews/~4/V3IQTdCvjoc\" height=\"1\" width=\"1\" alt=\"\"/>", "URL": "https://thehackernews.com/2019/12/web-application-cybersecurity.html"}, {"Source": "The Hacker News", "Title": "British Hacker Accused of Blackmailing healthcare Firms Extradited to U.S.", "Date": "Thu, 19 Dec 2019 03:45:54 PST", "Description": "A British man suspected to be a member of 'The Dark Overlord,' an infamous international hacking group, has finally been extradited to the United States after being held for over two years in the United Kingdom.\n\nNathan Francis Wyatt, 39, appeared in federal court in St. Louis, Missouri, on Wednesday to face charges related to his role in hacking healthcare and accounting companies in the U.S.<img src=\"http://feeds.feedburner.com/~r/TheHackersNews/~4/EslaJYVN1iM\" height=\"1\" width=\"1\" alt=\"\"/>", "URL": "https://thehackernews.com/2019/12/dark-overlord-hacker-extradited.html"}, {"Source": "The Hacker News", "Title": "Google Offers Financial Support to Open Source Projects for Cybersecurity", "Date": "Wed, 18 Dec 2019 10:40:37 PST", "Description": "Besides rewarding ethical hackers from its pocket for responsibly reporting vulnerabilities in third-party open-source projects, Google today announced financial support for open source developers to help them arrange additional resources, prioritizing the security of their products.\n\nThe initiative, called \"Patch Rewards Program,\" was launched nearly 6 years ago, under which Google rewards<img src=\"http://feeds.feedburner.com/~r/TheHackersNews/~4/353OkO8KIHQ\" height=\"1\" width=\"1\" alt=\"\"/>", "URL": "https://thehackernews.com/2019/12/google-open-source-projects.html"}, {"Source": "The Hacker News", "Title": "LifeLabs Paid Hackers to Recover Stolen Medical Data of 15 Million Canadians", "Date": "Wed, 18 Dec 2019 07:18:05 PST", "Description": "LifeLabs, the largest provider of healthcare laboratory testing services in Canada, has suffered a massive data breach that exposed the personal and medical information of nearly 15 million Canadians customers.\n\nThe company announced the breach in a press release posted on its website, revealing that an unknown attacker unauthorizedly accessed its computer systems last month and stole customers<img src=\"http://feeds.feedburner.com/~r/TheHackersNews/~4/IvO5xWw01rU\" height=\"1\" width=\"1\" alt=\"\"/>", "URL": "https://thehackernews.com/2019/12/lifelabs-data-breach.html"}, {"Source": "The Hacker News", "Title": "14 Ways to Evade Botnet Malware Attacks On Your Computers", "Date": "Wed, 18 Dec 2019 05:34:27 PST", "Description": "Cybercriminals are busy innovators, adapting their weapons and attack strategies, and ruthlessly roaming the web in search of their next big score.\n\nEvery manner of sensitive information, such as confidential employee records, customers' financial data, protected medical documents, and government files, are all subject to their relentless threats to cybersecurity.\n\nSolutions span a broad<img src=\"http://feeds.feedburner.com/~r/TheHackersNews/~4/aF-sRUU0wz0\" height=\"1\" width=\"1\" alt=\"\"/>", "URL": "https://thehackernews.com/2019/12/botnet-malware-attacks.html"}, {"Source": "The Hacker News", "Title": "The 2020 State of Breach Protection Survey – Call for Participation", "Date": "Tue, 17 Dec 2019 05:19:16 PST", "Description": "2010-2019 decade will be remembered as the time in which cybersecurity became acknowledged as a critical concern for all organizations.\n\nWith rapidly growing security needs and respective budgets, it is now more essential than ever for security decision-makers to zoom out of the 'products' mindset and assess their security stack in light of the overall breach protection value that their<img src=\"http://feeds.feedburner.com/~r/TheHackersNews/~4/QyvNci6okl8\" height=\"1\" width=\"1\" alt=\"\"/>", "URL": "https://thehackernews.com/2019/12/breach-protection-survey.html"}, {"Source": "The Hacker News", "Title": "This Bug Could Have Let Anyone Crash WhatsApp Of All Group Members", "Date": "Tue, 17 Dec 2019 12:45:11 PST", "Description": "WhatsApp, the world's most popular end-to-end encrypted messaging application, patched an incredibly frustrating software bug that could have allowed a malicious group member to crash the messaging app for all members of the same group, The Hacker News learned.\n\nJust by sending a maliciously crafted message to a targeted group, an attacker can trigger a fully-destructive WhatsApp crash-loop,<img src=\"http://feeds.feedburner.com/~r/TheHackersNews/~4/7GbV3JlKhRE\" height=\"1\" width=\"1\" alt=\"\"/>", "URL": "https://thehackernews.com/2019/12/whatsapp-group-crash.html"}, {"Source": "The Hacker News", "Title": "5 Reasons Why Programmers Should Think like Hackers", "Date": "Mon, 16 Dec 2019 05:11:49 PST", "Description": "Programming has five main steps: the identification and definition of the problem, the planning of the solution for the problem, coding of the program, testing, and documentation. \n\nIt's a meticulous process that cannot be completed without going through all the essential points. In all of these, security must be taken into account. As you come up with a solution to the problem and write the<img src=\"http://feeds.feedburner.com/~r/TheHackersNews/~4/Jsys2j9kQjM\" height=\"1\" width=\"1\" alt=\"\"/>", "URL": "https://thehackernews.com/2019/12/cybersecurity-for-programmers.html"}, {"Source": "The Hacker News", "Title": "Flaw in Elementor and Beaver Addons Let Anyone Hack WordPress Sites", "Date": "Fri, 13 Dec 2019 02:53:40 PST", "Description": "Attention WordPress users!\n\nYour website could easily get hacked if you are using \"Ultimate Addons for Beaver Builder,\" or \"Ultimate Addons for Elementor\" and haven't recently updated them to the latest available versions.\n\nSecurity researchers have discovered a critical yet easy-to-exploit authentication bypass vulnerability in both widely-used premium WordPress plugins that could allow<img src=\"http://feeds.feedburner.com/~r/TheHackersNews/~4/FT8plHIZrDs\" height=\"1\" width=\"1\" alt=\"\"/>", "URL": "https://thehackernews.com/2019/12/wordpress-elementor-beaver.html"}, {"Source": "The Hacker News", "Title": "Russian Police Raided NGINX Moscow Office, Detained Co-Founders", "Date": "Thu, 12 Dec 2019 11:06:05 PST", "Description": "Russian law enforcement officers have raided the Moscow offices of Nginx—the company behind the world's second most popular web server software—over a copyright infringement complaint filed by Rambler, a Russian Internet portal and email service provider.\n\nAccording to multiple reports from local media and social media, the police conducted searches and has also detained several employees of<img src=\"http://feeds.feedburner.com/~r/TheHackersNews/~4/gQvjQSweDxs\" height=\"1\" width=\"1\" alt=\"\"/>", "URL": "https://thehackernews.com/2019/12/nginx-copyright-rumbler.html"}, {"Source": "The Hacker News", "Title": "New Zeppelin Ransomware Targeting Tech and Health Companies", "Date": "Wed, 11 Dec 2019 08:16:14 PST", "Description": "A new variant of Vega ransomware family, dubbed Zeppelin, has recently been spotted in the wild targeting technology and healthcare companies across Europe, the United States, and Canada.\n\nHowever, if you reside in Russia or some other ex-USSR countries like Ukraine, Belorussia, and Kazakhstan, breathe a sigh of relief, as the ransomware terminates its operations if found itself on machines<img src=\"http://feeds.feedburner.com/~r/TheHackersNews/~4/Er78UnmGkao\" height=\"1\" width=\"1\" alt=\"\"/>", "URL": "https://thehackernews.com/2019/12/zeppelin-ransomware-attacks.html"}]}